import { useState } from "react";
import Select from "../components/Select";
import RadioSelect from "../components/SelectRadio";
import ProductAddCart from "../components/Product/ProductAddCart";

const sortOptions = [
  {
    id: 1,
    value: "popular",
    name: "По популярности",
    icon: null,
  },
  {
    id: 2,
    value: "price_high",
    name: "По цене (дорогие)",
    icon: (
      <svg
        width="16"
        height="16"
        viewBox="0 0 16 16"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M13 0.75C13 0.335786 12.6642 0 12.25 0C11.8358 0 11.5 0.335786 11.5 0.75V13.3219L10.0529 11.7432C9.77297 11.4379 9.29855 11.4172 8.99321 11.6971C8.68787 11.977 8.66724 12.4515 8.94714 12.7568L11.6971 15.7568C11.8392 15.9118 12.0398 16 12.25 16C12.4602 16 12.6608 15.9118 12.8029 15.7568L15.5529 12.7568C15.8328 12.4515 15.8121 11.977 15.5068 11.6971C15.2015 11.4172 14.727 11.4379 14.4471 11.7432L13 13.3219V0.75ZM0.75 1.5C0.335786 1.5 0 1.83579 0 2.25C0 2.66421 0.335786 3 0.75 3H9.25C9.66421 3 10 2.66421 10 2.25C10 1.83579 9.66421 1.5 9.25 1.5H0.75ZM3 5.25C3 4.83579 3.33579 4.5 3.75 4.5H9.25C9.66421 4.5 10 4.83579 10 5.25C10 5.66421 9.66421 6 9.25 6H3.75C3.33579 6 3 5.66421 3 5.25ZM6.75 7.5C6.33579 7.5 6 7.83579 6 8.25C6 8.66421 6.33579 9 6.75 9H9.25C9.66421 9 10 8.66421 10 8.25C10 7.83579 9.66421 7.5 9.25 7.5H6.75Z"
          fill="#787E87"
          fillOpacity="0.6"
        />
      </svg>
    ),
  },
  {
    id: 3,
    value: "price_low",
    name: "По цене (дешёвые)",
    icon: (
      <svg
        width="16"
        height="16"
        viewBox="0 0 16 16"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M3 15.25C3 15.6642 3.33578 16 3.75 16C4.16421 16 4.5 15.6642 4.5 15.25L4.5 2.6781L5.94713 4.25679C6.22703 4.56213 6.70145 4.58276 7.00679 4.30287C7.31213 4.02297 7.33276 3.54855 7.05286 3.24321L4.30286 0.243205C4.16081 0.0882339 3.96023 -1.05255e-06 3.75 -1.07093e-06C3.53977 -1.08931e-06 3.33919 0.0882338 3.19713 0.243205L0.447132 3.2432C0.167237 3.54854 0.187864 4.02297 0.493204 4.30286C0.798543 4.58276 1.27297 4.56213 1.55286 4.25679L3 2.6781L3 15.25ZM15.25 14.5C15.6642 14.5 16 14.1642 16 13.75C16 13.3358 15.6642 13 15.25 13L6.75 13C6.33579 13 6 13.3358 6 13.75C6 14.1642 6.33579 14.5 6.75 14.5L15.25 14.5ZM13 10.75C13 11.1642 12.6642 11.5 12.25 11.5L6.75 11.5C6.33579 11.5 6 11.1642 6 10.75C6 10.3358 6.33579 10 6.75 10L12.25 10C12.6642 10 13 10.3358 13 10.75ZM9.25 8.5C9.66421 8.5 10 8.16421 10 7.75C10 7.33579 9.66421 7 9.25 7L6.75 7C6.33579 7 6 7.33579 6 7.75C6 8.16421 6.33579 8.5 6.75 8.5L9.25 8.5Z"
          fill="#787E87"
          fillOpacity="0.6"
        />
      </svg>
    ),
  },
  {
    id: 4,
    value: "rare",
    name: "По редкости",
    icon: null,
  },
];

export default function MainPage() {
  const [selectedItems, setSelectedItems] = useState([]);
  const [sort, setSort] = useState(sortOptions[0]);
  const [showSortModal, setShowSortModal] = useState(false);

  return (
    <div className="container flex flex-col flex-1 h-full gap-4 mx-auto">
      <div className="flex flex-col gap-[30px] p-[30px] bg-accent-300 rounded-2xl border border-white/5">
        <div className="flex items-center justify-between">
          <div className="flex flex-col gap-1.5">
          <h1 className="text-2xl font-semibold">Выбор предметов</h1>
          <p className="text-lg text-gray-100">Пожалуйста, выберите свои предметы, которые желаете обменять с Бабайка</p>
          </div>
        </div>
        <div className="flex w-full gap-8">
          <div className="flex flex-col w-full gap-4">
            <div className="h-fit flex justify-between w-full">
              <div className="flex items-center justify-between w-full gap-3">
                <div className="input-wrapper !py-3 !px-5 min-w-[380px]">
                  <svg
                    width="27"
                    height="28"
                    viewBox="0 0 27 28"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M25.9929 26.6804L18.8225 19.51M11.6521 23.0952C5.71194 23.0952 0.896484 18.2798 0.896484 12.3396C0.896484 6.39944 5.71194 1.58398 11.6521 1.58398C17.5923 1.58398 22.4077 6.39944 22.4077 12.3396C22.4077 18.2798 17.5923 23.0952 11.6521 23.0952Z"
                      stroke="#787E87"
                      stroke-width="1.7926"
                    />
                  </svg>

                  <input
                    type="text"
                    placeholder="Найти предмет"
                    className="input-field w-full"
                  />
                </div>
                <div className="flex items-center gap-2">
                  <button className="btn btn-primary">Выбрать все</button>

                  <div className="relative h-full">
                    <button
                      className="btn  !bg-accent-200   h-full flex items-center !px-2 min-w-[250px] !justify-between !text-gray-100 gap-2"
                      onClick={() => setShowSortModal(!showSortModal)}
                    >
                      {sort.name}
                      <svg
                        width="10"
                        height="6"
                        viewBox="0 0 10 6"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M0.182992 0.374643C0.300196 0.257474 0.459139 0.191652 0.624866 0.191652C0.790594 0.191652 0.949536 0.257474 1.06674 0.374643L4.99987 4.30777L8.93299 0.374643C8.99064 0.314949 9.05961 0.267335 9.13586 0.234579C9.21211 0.201824 9.29413 0.184583 9.37711 0.183861C9.4601 0.18314 9.5424 0.198954 9.61921 0.23038C9.69602 0.261805 9.7658 0.308213 9.82449 0.366896C9.88317 0.425579 9.92958 0.495362 9.961 0.572172C9.99243 0.648982 10.0082 0.731281 10.0075 0.814269C10.0068 0.897256 9.98956 0.979268 9.9568 1.05552C9.92405 1.13177 9.87643 1.20074 9.81674 1.25839L5.44174 5.63339C5.32454 5.75056 5.16559 5.81638 4.99987 5.81638C4.83414 5.81638 4.6752 5.75056 4.55799 5.63339L0.182992 1.25839C0.0658222 1.14119 0 0.982246 0 0.816518C0 0.65079 0.0658222 0.491848 0.182992 0.374643Z"
                          fill="#787E87"
                        />
                      </svg>
                    </button>

                    {showSortModal && (
                      <div className="absolute top-full right-0 mt-2 z-50 w-80">
                        <RadioSelect
                          options={sortOptions}
                          defaultValue={sort}
                          onChange={(option) => {
                            setSort(option);
                            setShowSortModal(false);
                          }}
                        />
                      </div>
                    )}
                  </div>
                </div>
              </div>
            </div>
            <div className="2xl:grid-cols-6 gap-7 max-h-[815px] overflow-y-auto grid grid-cols-5">
              {Array.from({ length: 100 }).map((_, index) => (
                <ProductAddCart
                  key={index}
                  isAuthor={index % 2 === 0}
                  isInInventory={selectedItems.includes(index)}
                  setSelectedItem={() => {
                    if (selectedItems.includes(index)) {
                      setSelectedItems(
                        selectedItems.filter((item) => item !== index)
                      );
                    } else {
                      setSelectedItems([...selectedItems, index]);
                    }
                  }}
                  product={{
                    name: `Наклейка|Titan ${index + 1}`,
                    image: "/assets/images/skins/knife.png",
                    price: "361 215.18",
                    rarity: "field_tested",
                    phase: 0.05721636621,
                    condition: 50,
                  }}
                />
              ))}
            </div>
          </div>
          <div className="px-3.5 py-6 max-w-[400px] max-h-[850px] w-full bg-accent-200 rounded-2xl flex flex-col">
            <div className="flex items-center justify-between">
              <p className="text-2xl font-semibold">
              Вы предлагаете <span className="text-gray-100 ">(10)</span>
              </p>
              <div className="cursor-pointer hover:scale-95 transition-all duration-300">
                <svg
                  width="48"
                  height="49"
                  viewBox="0 0 48 49"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <rect
                    x="1.3125"
                    y="1.13672"
                    width="46.1878"
                    height="46.8675"
                    rx="23.0939"
                    stroke="#FF0000"
                  />
                  <path
                    d="M21.6876 15.3946H27.1252C27.1252 13.893 25.9079 12.6758 24.4064 12.6758C22.9049 12.6758 21.6876 13.893 21.6876 15.3946ZM19.6485 15.3946C19.6485 12.7669 21.7787 10.6367 24.4064 10.6367C27.0341 10.6367 29.1643 12.7669 29.1643 15.3946H36.9807C37.5438 15.3946 38.0003 15.851 38.0003 16.4141C38.0003 16.9772 37.5438 17.4337 36.9807 17.4337H35.1876L33.5943 33.8975C33.3415 36.5105 31.1455 38.5042 28.5203 38.5042H20.2925C17.6673 38.5042 15.4713 36.5105 15.2185 33.8975L13.6252 17.4337H11.832C11.269 17.4337 10.8125 16.9772 10.8125 16.4141C10.8125 15.851 11.269 15.3946 11.832 15.3946H19.6485ZM22.3673 21.8517C22.3673 21.2886 21.9108 20.8321 21.3478 20.8321C20.7847 20.8321 20.3282 21.2886 20.3282 21.8517V32.0471C20.3282 32.6102 20.7847 33.0666 21.3478 33.0666C21.9108 33.0666 22.3673 32.6102 22.3673 32.0471V21.8517ZM27.465 20.8321C26.9019 20.8321 26.4455 21.2886 26.4455 21.8517V32.0471C26.4455 32.6102 26.9019 33.0666 27.465 33.0666C28.0281 33.0666 28.4846 32.6102 28.4846 32.0471V21.8517C28.4846 21.2886 28.0281 20.8321 27.465 20.8321Z"
                    fill="#FF4E4E"
                    fill-opacity="0.51"
                  />
                </svg>
              </div>
            </div>
            <div className="h-full flex justify-start items-start flex-col gap-3.5">
              <CartItem />
              <CartItem />
            </div>
            <div className="py-3 flex-col  flex justify-center items-center gap-2.5 border-white/5 border-t-2">
              <div className="px-4 py-5 flex items-center justify-between w-full bg-gray-100/10 rounded-lg">
                <div className="flex flex-col gap-2.5 items-center ">
                  <p className="text-lg leading-none font-semibold ">
                    ~193 180 ₽
                  </p>
                  <p className=" leading-none font-normal text-gray-100 ">
                    Получаете
                  </p>
                </div>
                <svg
                className="mr-10"
                  width="21"
                  height="28"
                  viewBox="0 0 21 28"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M14.776 1.0553L20.1093 6.38196C20.3391 6.61138 20.4773 6.91676 20.4979 7.2408C20.5185 7.56484 20.4202 7.88527 20.2213 8.14196L20.1107 8.2673L14.7773 13.6086C14.5379 13.8503 14.2152 13.9913 13.8753 14.0029C13.5353 14.0144 13.2038 13.8956 12.9486 13.6707C12.6933 13.4458 12.5337 13.1318 12.5024 12.7931C12.4711 12.4544 12.5704 12.1165 12.78 11.8486L12.8907 11.7233L15.944 8.66596H1.83333C1.50653 8.66625 1.191 8.54649 0.946669 8.32945C0.702342 8.11241 0.546236 7.81319 0.508 7.48863L0.5 7.33263C0.500043 7.00605 0.619941 6.69085 0.836953 6.4468C1.05397 6.20275 1.353 6.04684 1.67733 6.00863L1.83333 5.9993H15.9533L12.892 2.94196C12.6622 2.71254 12.5241 2.40716 12.5035 2.08312C12.4828 1.75909 12.5812 1.43866 12.78 1.18196L12.8907 1.0553C13.1201 0.82553 13.4255 0.687376 13.7495 0.666756C14.0735 0.646135 14.394 0.744465 14.6507 0.943295L14.776 1.0553ZM20.4867 20.51L20.496 20.666C20.496 20.9925 20.3761 21.3077 20.159 21.5518C19.942 21.7958 19.643 21.9518 19.3187 21.99L19.1627 21.9993H5.05067L8.10933 25.0566C8.3391 25.286 8.47725 25.5914 8.49787 25.9155C8.51849 26.2395 8.42016 26.5599 8.22133 26.8166L8.11067 26.942C7.88125 27.1717 7.57587 27.3099 7.25183 27.3305C6.92779 27.3511 6.60736 27.2528 6.35067 27.054L6.224 26.942L0.890667 21.614C0.661098 21.3844 0.52319 21.0789 0.502815 20.7549C0.48244 20.4308 0.580998 20.1105 0.78 19.854L0.890667 19.7286L6.224 14.39C6.46339 14.1483 6.78609 14.0073 7.12606 13.9957C7.46603 13.9842 7.79756 14.103 8.05277 14.3279C8.30799 14.5528 8.4676 14.8667 8.49894 15.2055C8.53027 15.5442 8.43096 15.8821 8.22133 16.15L8.11067 16.2753L5.05733 19.3326H19.1627C19.4892 19.3327 19.8044 19.4526 20.0485 19.6696C20.2925 19.8866 20.4485 20.1856 20.4867 20.51Z"
                    fill="#787E87"
                    fill-opacity="0.6"
                  />
                </svg>
                <div className="flex flex-col gap-2.5 items-center ">
                  <p className="text-lg text-gray-100 leading-none font-semibold ">~0 ₽</p>
                  <p className=" leading-none font-normal text-gray-100 ">
                    Отдаёте
                  </p>
                </div>
              </div>
              <div className="w-full">
                <button className="btn !py-5 gap-3 btn-primary-light w-full ">
                  Далее
                  <svg
                    width="10"
                    height="15"
                    viewBox="0 0 10 15"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M1.5 14L8.5 7.5L1.5 1"
                      stroke="#8B52FF"
                      stroke-linecap="square"
                    />
                  </svg>
                </button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}
function CartItem() {
  return (
    <div className="flex flex-col  gap-3 w-full">
      <div className="flex items-center justify-between relative pt-2 z-50 overflow-hidden ">
        <div className="flex relative gap-3 items-center ">
          <div className="max-w-[80px] z-40 ">
            <img
              src="/assets/images/skins/knife.png"
              alt=""
              className="h-13 w-auto"
            />
          </div>
          <div className="flex flex-col ">
            <p className="text-sm font-semibold text-gray-100">★ Нож-бабочка</p>
            <p className="text-sm ">Убийство</p>
            <p className="text-sm text-gray-100 ">После полевых испытаний</p>
          </div>
        </div>
        <button>
          <svg
            width="25"
            height="25"
            viewBox="0 0 25 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M15.9442 9.15837C15.8512 9.06464 15.7406 8.99024 15.6188 8.93947C15.4969 8.88871 15.3662 8.86257 15.2342 8.86257C15.1022 8.86257 14.9715 8.88871 14.8496 8.93947C14.7278 8.99024 14.6172 9.06464 14.5242 9.15837L12.2342 11.4584L9.94421 9.15837C9.75591 8.97006 9.50051 8.86427 9.23421 8.86427C8.96791 8.86427 8.71251 8.97006 8.52421 9.15837C8.33591 9.34667 8.23012 9.60206 8.23012 9.86837C8.23012 10.1347 8.33591 10.3901 8.52421 10.5784L10.8242 12.8684L8.52421 15.1584C8.43048 15.2513 8.35609 15.3619 8.30532 15.4838C8.25455 15.6056 8.22841 15.7364 8.22841 15.8684C8.22841 16.0004 8.25455 16.1311 8.30532 16.2529C8.35609 16.3748 8.43048 16.4854 8.52421 16.5784C8.61717 16.6721 8.72777 16.7465 8.84963 16.7973C8.97149 16.848 9.1022 16.8742 9.23421 16.8742C9.36622 16.8742 9.49693 16.848 9.61879 16.7973C9.74065 16.7465 9.85125 16.6721 9.94421 16.5784L12.2342 14.2784L14.5242 16.5784C14.6172 16.6721 14.7278 16.7465 14.8496 16.7973C14.9715 16.848 15.1022 16.8742 15.2342 16.8742C15.3662 16.8742 15.4969 16.848 15.6188 16.7973C15.7406 16.7465 15.8512 16.6721 15.9442 16.5784C16.0379 16.4854 16.1123 16.3748 16.1631 16.2529C16.2139 16.1311 16.24 16.0004 16.24 15.8684C16.24 15.7364 16.2139 15.6056 16.1631 15.4838C16.1123 15.3619 16.0379 15.2513 15.9442 15.1584L13.6442 12.8684L15.9442 10.5784C16.0379 10.4854 16.1123 10.3748 16.1631 10.2529C16.2139 10.1311 16.24 10.0004 16.24 9.86837C16.24 9.73635 16.2139 9.60565 16.1631 9.48379C16.1123 9.36193 16.0379 9.25133 15.9442 9.15837ZM19.3042 5.79837C18.3817 4.84326 17.2783 4.08144 16.0583 3.55735C14.8382 3.03326 13.526 2.7574 12.1982 2.74586C10.8704 2.73432 9.55363 2.98734 8.32467 3.49015C7.09571 3.99296 5.97919 4.73549 5.04026 5.67442C4.10133 6.61334 3.3588 7.72986 2.85599 8.95883C2.35318 10.1878 2.10017 11.5046 2.11171 12.8324C2.12324 14.1602 2.39911 15.4724 2.9232 16.6924C3.44729 17.9125 4.20911 19.0159 5.16421 19.9384C6.08668 20.8935 7.19012 21.6553 8.41016 22.1794C9.6302 22.7035 10.9424 22.9793 12.2702 22.9909C13.598 23.0024 14.9148 22.7494 16.1438 22.2466C17.3727 21.7438 18.4892 21.0012 19.4282 20.0623C20.3671 19.1234 21.1096 18.0069 21.6124 16.7779C22.1152 15.5489 22.3683 14.2321 22.3567 12.9044C22.3452 11.5766 22.0693 10.2644 21.5452 9.04432C21.0211 7.82428 20.2593 6.72083 19.3042 5.79837ZM17.8942 18.5284C16.5863 19.8378 14.8647 20.6532 13.023 20.8357C11.1813 21.0182 9.33322 20.5564 7.79373 19.5291C6.25425 18.5019 5.11857 16.9726 4.58018 15.2018C4.0418 13.4311 4.13402 11.5285 4.84112 9.81815C5.54823 8.10779 6.82648 6.69551 8.4581 5.82193C10.0897 4.94834 11.9738 4.6675 13.7892 5.02724C15.6047 5.38698 17.2393 6.36506 18.4145 7.79483C19.5896 9.2246 20.2328 11.0176 20.2342 12.8684C20.2378 13.9197 20.0328 14.9612 19.6311 15.9327C19.2295 16.9043 18.6391 17.7865 17.8942 18.5284Z"
              fill="#AE090C"
            />
          </svg>
        </button>
        <div className="absolute top-1/2 -translate-y-1/2 bg-field_tested rounded-full w-10 h-12 left-0 z-30 blur-2xl"></div>
      </div>
    </div>
  );
}
